{
    "title": "IBM Key Protect docs",
    "lastupdated": "2021-06-04",
    "introduction": "IBM® Key Protect is a full-service encryption solution that allows data to be secured and stored in IBM Cloud™ using the latest envelope encryption techniques. Encryption keys can be provisioned or imported for use with applications for many IBM Cloud™ services and then managed from a central location.",
    "section_devtools": {
      "api": "/apidocs/key-protect",
      "cli": "/docs/key-protect?topic=key-protect-cli-plugin-key-protect-cli-reference",
      "terraform": "https://registry.terraform.io/modules/terraform-ibm-modules/kms/ibm/latest/submodules/key-protect"
    },
    "section_recommended": [
      {
        "title": "Getting started with Key Protect",
        "description": "Learn how to create or import existing cryptographic keys using the Key Potect dashboard.",
        "href": "/docs/key-protect?topic=key-protect-getting-started-tutorial"
      },
      {
        "title": "Protecting data with envelope encryption",
        "description": "Learn how envelope encryption, which forms the backbone of Key Protect, works to secure your data.",
        "href": "/docs/key-protect?topic=key-protect-envelope-encryption"
      },
      {
        "title": "Grouping keys together using key rings",
        "description": "Learn how to use use Key Protect to create a group of keys for a target group of users that require the same IAM access permissions.",
        "href": "/docs/key-protect?topic=key-protect-grouping-keys"
      }
    ],
    "section_learn": {
      "developer": "https://developer.ibm.com/depmodels/cloud/",
      "architecture": "https://www.ibm.com/cloud/architecture",
      "training": "https://www.ibm.com/training/cloud",
      "community": "https://community.ibm.com/community/user/publiccloud/home"
    },
    "section_updates": {
      "view_more": "/docs/key-protect?topic=key-protect-releases",
      "tiles": [
        {
          "date": "5 August 2021",
          "title": "Updates to the Key Protect console and Key purge feature",
          "description": "The ability to purge keys that have been deleted after four hours using the UI has been added. Also, the ability to view your instance ID and cloud resource name (CRN) has been made easier."
        },
        {
          "date": "30 June 2021",
          "title": "Updates to the Key Protect CLI plugin",
          "description": "The IBM Cloud Key Protect CLI plugin has been updated to version 0.6.3. Minor changes include support for HPCS and Key rotate."
        },
        {
          "date": "22 April 2021",
          "title": "Updates to Key Protect console and Key purge feature",
          "description": "Many of the panels and actions you can take in the console have been modified to accommodate the addition of key rings. This includes a new Key rings panel where key rings can be managed and a Key ring ID column in the Keys panel. Also, the ability to purge keys four hours after they have been moved to the Destroyed state has been added."
        }
      ]
    }
  }
